{
    "title": "Direct Link (2.0) docs",
    "lastupdated": "2022-04-01",
    "introduction": "The IBM Cloud Direct Link (2.0) solution is designed to seamlessly connect your on-premises resources to your cloud resources. Leverage the docs, CLI, and API reference to plan for, provision, and manage your direct links.",
    "section_devtools": {
      "api": "/apidocs/direct_link",
      "cli": "/docs/dl?topic=dl-cli-plugin-dl-cli",
      "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/dl_gateway"
    },
    "section_recommended": [
      {
        "title": "Ordering Direct Link Dedicated",
        "description": "Terminate a single-tenant, fiber-based, cross connect into your own IBM Cloud private network connection. Also used by colocation facilities adjacent to IBM Cloud PoPs and data centers.",
        "href": "/docs/dl?topic=dl-how-to-order-ibm-cloud-dl-dedicated"
      },
      {
        "title": "Ordering Direct Link Connect",
        "description": "Fast setup! Leverage a service provider to quickly establish and deliver connectivity to IBM Cloud locations. Ideal for multi-cloud environments with your service provider's network.",
        "href": "/docs/dl?topic=dl-how-to-order-ibm-cloud-dl-connect"
      }
    ],
    "section_videos": [
      {
        "title": "IBM Cloud Direct Link for hybrid cloud",
        "href": "/docs/dl?topic=dl-offering-video",
        "thumbnail": "/images/thumbnail.png"
      }
    ],
    "section_learn": {
      "developer": "https://developer.ibm.com/depmodels/cloud/",
      "architecture": "https://www.ibm.com/cloud/architecture",
      "training": "https://www.ibm.com/training/cloud",
      "community": "https://community.ibm.com/community/user/publiccloud/search?executeSearch=true&SearchTerm=direct%20link&rf=%5EMulti04%3Adirect%5E"
    },
    "section_updates": {
      "view_more": "/docs/dl?topic=dl-direct-link-release-notes",
      "tiles": [
        {
          "date": "01 April 2022",
          "title": "Reduced unmetered pricing plan for Direct Link Connect",
          "description": "IBM is pleased to announce  a significant reduction in unmetered pricing for IBM Cloud Direct Link Connect and Direct Link Dedicated. Note that Direct Link also offers a metered pricing plan, allowing you to switch between metered and unmetered pricing plans to suit your bandwidth usage needs."
        },  
        {
            "date": "24 September 2021",
            "title": "Bidirectional Forwarding Detection (BFD)",
            "description": "Activate BFD to quickly detect faults in a network between two routers or switches that are connected by a link. BFD provides a single, standardized method for detecting link failures at any protocol layer, over any media. Also, instead of being able to specify BGP values (ASN and IP addresses) only during initial configuration, you can now modify BGP values after direct link provisioning."
          },          
          {
            "date": "30 August 2021",
            "title": "Direct Link (2.0) connection support for transit gateways",
            "description": "Direct Link now supports Transit Gateway connections. A Direct Link connection allows an on-premises network to connect to other networks that are connected to the same transit gateway. If you participated in the beta for this release, you can continue to use the gateways that you created during the beta."
          },
        {
          "date": "30 June 2021",
          "title": "Message Digest 5 support",
          "description": "BGP authentication enables routers to share information only if they can verify that they are talking to a trusted source, based on a key. You can store keys in either Key Protect or Hyper Protect Crypto Services."
        }
      ]
    }
  }
